#+TITLE: Daily Habbits to Improve Myself
#+AUTHOR: Zhitao Gong(巩志焘)
#+EMAIL: zhitaao.gong@gmail.com
#+DATE: 2012-09-25

#+COLUMNS: %40ITEM %6Effort{:} %6CLOCKSUM %30TAGS
#+PROPERTY: LOGGING DONE(!)
#+PROPERTY: Effort_ALL 0 0:15 0:30 1:00 2:00 3:00 4:00 5:00
#+STARTUP: content logrepeat

* Habits
** TODO [#A] Algorithm                                          :code:
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2013-06-19 Wed 23:13]
   CLOCK: [2012-12-04 Tue 20:02]--[2012-12-04 Tue 22:16] =>  2:14
   CLOCK: [2012-12-01 Sat 14:56]--[2012-12-01 Sat 15:54] =>  0:58
   CLOCK: [2012-12-01 Sat 10:45]--[2012-12-01 Sat 11:44] =>  0:59
- State "DONE"       from "TODO"       [2012-11-30 Fri 14:35]
   CLOCK: [2012-11-29 Thu 09:57]--[2012-11-29 Thu 12:17] =>  2:20
   CLOCK: [2012-11-23 Fri 17:44]--[2012-11-23 Fri 18:07] =>  0:23
   CLOCK: [2012-11-15 Thu 15:41]--[2012-11-15 Thu 18:20] =>  2:39
   CLOCK: [2012-11-15 Thu 10:49]--[2012-11-15 Thu 10:49] =>  0:00
   CLOCK: [2012-11-15 Thu 08:30]--[2012-11-15 Thu 10:49] =>  2:19
   CLOCK: [2012-11-13 Tue 14:42]--[2012-11-13 Tue 17:48] =>  3:06
   CLOCK: [2012-11-12 Mon 12:08]--[2012-11-12 Mon 17:32] =>  5:24
   CLOCK: [2012-11-12 Mon 09:06]--[2012-11-12 Mon 10:52] =>  1:46
   CLOCK: [2012-11-11 Sun 14:00]--[2012-11-11 Sun 18:27] =>  4:27
   CLOCK: [2012-11-11 Sun 10:18]--[2012-11-11 Sun 12:08] =>  1:50
   CLOCK: [2012-11-11 Sun 09:39]--[2012-11-11 Sun 10:17] =>  0:38
   CLOCK: [2012-11-10 Sat 19:57]--[2012-11-10 Sat 21:41] =>  1:44
   CLOCK: [2012-11-08 Thu 22:19]--[2012-11-08 Thu 22:26] =>  0:07
- State "DONE"       from "TODO"       [2012-11-07 Wed 11:34]
   CLOCK: [2012-11-06 Tue 11:01]--[2012-11-06 Tue 11:58] =>  0:57
   CLOCK: [2012-11-05 Mon 14:11]--[2012-11-05 Mon 16:10] =>  1:59
   CLOCK: [2012-11-04 Sun 14:25]--[2012-11-04 Sun 16:16] =>  1:51
   CLOCK: [2012-11-03 Sat 08:01]--[2012-11-03 Sat 12:25] =>  4:24
- State "DONE"       from "TODO"       [2012-11-02 Fri 20:24]
   CLOCK: [2012-11-02 Fri 18:29]--[2012-11-02 Fri 20:24] =>  1:55
- State "DONE"       from "TODO"       [2012-10-30 Tue 17:35]
   CLOCK: [2012-10-29 Mon 20:01]--[2012-10-29 Mon 20:52] =>  0:51
   CLOCK: [2012-10-24 Wed 20:05]--[2012-10-24 Wed 21:26] =>  1:21
   CLOCK: [2012-10-23 Tue 16:18]--[2012-10-23 Tue 22:14] =>  5:56
   CLOCK: [2012-10-23 Tue 12:11]--[2012-10-23 Tue 12:41] =>  0:30
   CLOCK: [2012-10-23 Tue 11:25]--[2012-10-23 Tue 11:46] =>  0:21
   CLOCK: [2012-10-22 Mon 19:32]--[2012-10-22 Mon 20:08] =>  0:36
   CLOCK: [2012-10-22 Mon 16:49]--[2012-10-22 Mon 17:33] =>  0:44
   CLOCK: [2012-10-21 Sun 17:48]--[2012-10-21 Sun 21:42] =>  3:54
   CLOCK: [2012-10-20 Sat 21:14]--[2012-10-20 Sat 22:08] =>  0:54
- State "DONE"       from "TODO"       [2012-10-16 Tue 20:38]
   CLOCK: [2012-10-16 Tue 18:25]--[2012-10-16 Tue 20:38] =>  2:13
   CLOCK: [2012-10-14 Sun 18:39]--[2012-10-14 Sun 20:44] =>  2:05
   CLOCK: [2012-10-14 Sun 17:49]--[2012-10-14 Sun 17:58] =>  0:09
- State "DONE"       from "TODO"       [2012-10-12 Fri 21:29]
   CLOCK: [2012-10-12 Fri 17:50]--[2012-10-12 Fri 21:29] =>  3:39
- State "DONE"       from "NEXT"       [2012-10-11 Thu 21:27]
   CLOCK: [2012-10-11 Thu 19:56]--[2012-10-11 Thu 21:27] =>  1:31
- State "DONE"       from "TODO"       [2012-10-04 Thu 20:31]
   CLOCK: [2012-10-04 Thu 17:15]--[2012-10-04 Thu 20:31] =>  3:16
- State "DONE"       from "TODO"       [2012-10-03 Wed 20:15]
   CLOCK: [2012-10-03 Wed 18:54]--[2012-10-03 Wed 20:15] =>  1:21
   CLOCK: [2012-10-03 Wed 17:52]--[2012-10-03 Wed 18:22] =>  0:30
- State "DONE"       from "TODO"       [2012-10-02 Tue 21:54]
   CLOCK: [2012-10-02 Tue 18:13]--[2012-10-02 Tue 21:54] =>  3:41
- State "DONE"       from "TODO"       [2012-10-01 Mon 22:17]
   CLOCK: [2012-10-01 Mon 19:40]--[2012-10-01 Mon 22:17] =>  2:37
- State "DONE"       from "NEXT"       [2012-09-30 Sun 23:42]
   CLOCK: [2012-09-30 Sun 16:10]--[2012-09-30 Sun 19:16] =>  3:06
   CLOCK: [2012-09-30 Sun 09:25]--[2012-09-30 Sun 11:17] =>  1:52
- State "DONE"       from "TODO"       [2012-09-26 Wed 22:56]
   CLOCK: [2012-09-26 Wed 20:32]--[2012-09-26 Wed 22:56] =>  2:24
   :END:
   :PROPERTIES:
   :Effort:   3:00
   :LAST_REPEAT: [2013-06-19 Wed 23:13]
   :END:
   SCHEDULED: <2013-06-20 Thu .+1d>

** TODO TED                                                    :video:
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2013-06-19 Wed 23:13]
   - State "DONE"       from "TODO"       [2013-05-02 Thu 09:05]
   - State "DONE"       from "TODO"       [2013-03-31 Sun 18:48]
   - State "DONE"       from "TODO"       [2013-03-29 Fri 23:20]
   - State "DONE"       from "TODO"       [2013-03-09 Sat 22:41]
   - State "DONE"       from "TODO"       [2013-03-08 Fri 08:16]
   - State "DONE"       from "TODO"       [2013-03-06 Wed 13:03]
   - State "DONE"       from "TODO"       [2013-02-25 Mon 16:13]
   - State "DONE"       from "TODO"       [2013-02-21 Thu 20:09]
   - State "DONE"       from "TODO"       [2013-02-20 Wed 11:00]
   - State "DONE"       from "TODO"       [2013-02-17 Sun 08:17]
   CLOCK: [2013-02-17 Sun 07:59]--[2013-02-17 Sun 08:17] =>  0:18
   - State "DONE"       from "TODO"       [2013-02-15 Fri 09:29]
- State "DONE"       from "TODO"       [2012-12-07 Fri 14:05]
   CLOCK: [2012-12-07 Fri 13:49]--[2012-12-07 Fri 14:05] =>  0:16
   CLOCK: [2012-11-08 Thu 22:55]--[2012-11-08 Thu 23:01] =>  0:06
   CLOCK: [2012-11-05 Mon 23:06]--[2012-11-05 Mon 23:14] =>  0:08
- State "DONE"       from "TODO"       [2012-11-04 Sun 22:29]
   CLOCK: [2012-11-04 Sun 22:06]--[2012-11-04 Sun 22:29] =>  0:23
- State "DONE"       from "TODO"       [2012-11-02 Fri 21:09]
   CLOCK: [2012-11-02 Fri 20:26]--[2012-11-02 Fri 21:09] =>  0:43
   CLOCK: [2012-10-31 Wed 22:57]--[2012-10-31 Wed 23:16] =>  0:19
- State "DONE"       from "TODO"       [2012-10-30 Tue 20:15]
   CLOCK: [2012-10-30 Tue 19:48]--[2012-10-30 Tue 20:15] =>  0:27
- State "DONE"       from "TODO"       [2012-10-29 Mon 19:58]
- State "DONE"       from "TODO"       [2012-10-28 Sun 20:46]
   CLOCK: [2012-10-28 Sun 20:21]--[2012-10-28 Sun 20:46] =>  0:25
- State "DONE"       from "TODO"       [2012-10-27 Sat 22:44]
   CLOCK: [2012-10-27 Sat 22:26]--[2012-10-27 Sat 22:44] =>  0:18
- State "DONE"       from "TODO"       [2012-10-26 Fri 22:01]
   CLOCK: [2012-10-26 Fri 22:01]--[2012-10-26 Fri 22:01] =>  0:00
- State "DONE"       from "TODO"       [2012-10-23 Tue 22:38]
   CLOCK: [2012-10-23 Tue 22:16]--[2012-10-23 Tue 22:38] =>  0:22
- State "DONE"       from "TODO"       [2012-10-21 Sun 22:42]
   CLOCK: [2012-10-21 Sun 22:23]--[2012-10-21 Sun 22:42] =>  0:19
- State "DONE"       from "TODO"       [2012-10-20 Sat 21:02]
   CLOCK: [2012-10-20 Sat 20:43]--[2012-10-20 Sat 21:02] =>  0:19
- State "DONE"       from "TODO"       [2012-10-19 Fri 22:10]
   CLOCK: [2012-10-19 Fri 21:47]--[2012-10-19 Fri 22:10] =>  0:23
- State "DONE"       from "TODO"       [2012-10-18 Thu 23:13]
   CLOCK: [2012-10-18 Thu 23:06]--[2012-10-18 Thu 23:13] =>  0:07
- State "DONE"       from "NEXT"       [2012-09-28 Fri 22:35]
   CLOCK: [2012-09-28 Fri 22:14]--[2012-09-28 Fri 22:35] =>  0:21
- State "DONE"       from "TODO"       [2012-09-26 Wed 20:25]
   CLOCK: [2012-09-26 Wed 20:09]--[2012-09-26 Wed 20:25] =>  0:16
   :END:
   :PROPERTIES:
   :Effort:   0:30
   :LAST_REPEAT: [2013-06-19 Wed 23:13]
   :STYLE:    habit
   :END:
   SCHEDULED: <2013-06-20 Thu .+1d>
** TODO gitready                                                        :git:
   SCHEDULED: <2013-05-01 Wed .+1d>
   :PROPERTIES:
   :STYLE:    habit
   :END:
